// Задача 19
// Напишите программу, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом.
// Выполнить с помощью числовых операций (целочисленное деление, остаток от деления).
// 14212 -> нет
// 12821 -> да
// 23432 -> да

Console.WriteLine ("введите пятизначное число");
int number = Convert.ToInt32 (Console.ReadLine());

int FiveDigitsCheck (int num)
{
    if (num>9999&&num<=99999) return ;

    {
        
    }
}